//
// Generated by dtk
// Translation Unit: d_a_npc_ho.cpp
//

#include "f_op/f_op_actor_mng.h"
#include "JSystem/JKernel/JKRHeap.h"
#include "d/d_bg_s_acch.h"
#include "d/d_cc_d.h"
#include "d/d_com_inf_game.h"
#include "d/d_npc.h"
#include "d/d_procname.h"
#include "JSystem/J3DGraphAnimator/J3DNode.h"
#include "m_Do/m_Do_ext.h"
#include "dolphin/types.h"


class daNpc_Ho_c : public fopAc_ac_c {
public:
    daNpc_Ho_c() { m063C = false; m063B = false; }
    s16 XyCheckCB(int);
    void receivePendant(int);
    
    void initTexPatternAnm(bool);
    void playTexPatternAnm();
    
    void setAnm(s8);
    void setAnmStatus();

    void chkAttentionLocal();
    void chkAttention();

    void eventOrder();
    void checkOrder();

    void next_msg_sub0(u32);
    u16 next_msgStatus(u32*);
    u32 getMsg();

    void setCollision();

    void msgPushButton();
    void msgAnm(u8);

    void talkInit();
    void talk();
    s32 init();

    void setAttention(bool);
    void lookBack();

    void wait01();
    void talk01();
    void talk02();
    void talk03();

    void give01();
    void give02();

    void preach();

    void wait_action(void*);

    s32 CreateHeap();

    s32 _draw();
    s32 _execute();
    s32 _delete();
    s32 _create();

    /* 0x0290 */ request_of_phase_process_class mPhs;
    /* 0x0298 */ mDoExt_McaMorf* mpMcaMorf;
    /* 0x029C */ J3DModel* mpJoyPendantMdl;

    /* 0x02A0 */ u32 mShadowID;

    /* 0x02A4 */ J3DAnmTexPattern* mpCurBtpAnim;
    /* 0x02A8 */ mDoExt_btpAnm mBtpAnimator;
    /* 0x02BC */ u8 mBtpTimer;

    /* 0x02BE */ u16 mTimer1;

    /* 0x02C0 */ dBgS_ObjAcch mAcch;
    /* 0x0484 */ dBgS_AcchCir mAcchCir;
    /* 0x04C4 */ dCcD_Stts mColStts;
    /* 0x0500 */ dCcD_Cyl mCylinderCol;

    /* 0x0630 */ dNpc_JntCtrl_c* mpJntControl;

    /* 0x0634 */ s16 m0634;
    /* 0x0636 */ s16 mBackboneRotX;
    /* 0x0638 */ u8 mHeadJntIdx;
    /* 0x0639 */ u8 mBackboneJntIdx;
    /* 0x063A */ bool m063A;
    /* 0x063B */ bool m063B;
    /* 0x063C */ bool m063C;

    /* 0x063D */ u8 m063D[0x27]; // TODO: Does anything in this range do anything?

    /* 0x0664 */ cXyz mEyePos;
    /* 0x0670 */ cXyz mAttentionBasePos;

    /* 0x06A9 */ bool m06A9;

    // TODO: Move these elsewhere later
    void setEyePos(cXyz);
    void setAttentionBasePos(cXyz);
};

/* 00000078-0000022C       .text nodeCallBack_Ho__FP7J3DNodei */
void nodeCallBack_Ho(J3DNode* i_node, int i_param2) {
    /* Nonmatching */
}

/* 0000022C-0000024C       .text daNpc_ho_XyCheckCB__FPvi */
s16 daNpc_ho_XyCheckCB(void* i_actor, int i_param2) {
    return static_cast<daNpc_Ho_c*>(i_actor)->XyCheckCB(i_param2);
}

/* 0000024C-00000254       .text XyCheckCB__10daNpc_Ho_cFi */
s16 daNpc_Ho_c::XyCheckCB(int) {
    return TRUE;
}

/* 00000254-000002F8       .text receivePendant__10daNpc_Ho_cFi */
void daNpc_Ho_c::receivePendant(int) {
    /* Nonmatching */
}

/* 000002F8-0000040C       .text initTexPatternAnm__10daNpc_Ho_cFb */
void daNpc_Ho_c::initTexPatternAnm(bool) {
    /* Nonmatching */
}

/* 0000040C-00000498       .text playTexPatternAnm__10daNpc_Ho_cFv */
void daNpc_Ho_c::playTexPatternAnm() {
    /* Nonmatching */
}

/* 00000498-0000051C       .text setAnm__10daNpc_Ho_cFSc */
void daNpc_Ho_c::setAnm(signed char) {
    /* Nonmatching */
}

/* 0000051C-00000540       .text setAnmStatus__10daNpc_Ho_cFv */
void daNpc_Ho_c::setAnmStatus() {
    /* Nonmatching */
}

/* 00000540-000005F4       .text chkAttentionLocal__10daNpc_Ho_cFv */
void daNpc_Ho_c::chkAttentionLocal() {
    /* Nonmatching */
}

/* 000005F4-00000690       .text chkAttention__10daNpc_Ho_cFv */
void daNpc_Ho_c::chkAttention() {
    /* Nonmatching */
}

/* 00000690-00000708       .text eventOrder__10daNpc_Ho_cFv */
void daNpc_Ho_c::eventOrder() {
    /* Nonmatching */
}

/* 00000708-000007A8       .text checkOrder__10daNpc_Ho_cFv */
void daNpc_Ho_c::checkOrder() {
    /* Nonmatching */
}

/* 000007A8-00000884       .text next_msg_sub0__10daNpc_Ho_cFUl */
void daNpc_Ho_c::next_msg_sub0(u32) {
    /* Nonmatching */
}

/* 00000884-00000C0C       .text next_msgStatus__10daNpc_Ho_cFPUl */
u16 daNpc_Ho_c::next_msgStatus(u32*) {
    /* Nonmatching */
}

/* 00000C0C-00000DA8       .text getMsg__10daNpc_Ho_cFv */
u32 daNpc_Ho_c::getMsg() {
    /* Nonmatching */
}

/* 00000DA8-00000E4C       .text setCollision__10daNpc_Ho_cFv */
void daNpc_Ho_c::setCollision() {
    /* Nonmatching */
}

/* 00000E4C-00000E90       .text msgPushButton__10daNpc_Ho_cFv */
void daNpc_Ho_c::msgPushButton() {
    /* Nonmatching */
}

/* 00000E90-00000EF0       .text msgAnm__10daNpc_Ho_cFUc */
void daNpc_Ho_c::msgAnm(u8) {
    /* Nonmatching */
}

/* 00000EF0-00000F04       .text talkInit__10daNpc_Ho_cFv */
void daNpc_Ho_c::talkInit() {
    /* Nonmatching */
}

/* 00000F04-000010EC       .text talk__10daNpc_Ho_cFv */
void daNpc_Ho_c::talk() {
    /* Nonmatching */
}

/* 000010EC-000012B8       .text init__10daNpc_Ho_cFv */
s32 daNpc_Ho_c::init() {
    /* Nonmatching */
}

/* 000012B8-0000130C       .text setAttention__10daNpc_Ho_cFb */
void daNpc_Ho_c::setAttention(bool) {
    /* Nonmatching */
}

/* 0000130C-00001498       .text lookBack__10daNpc_Ho_cFv */
void daNpc_Ho_c::lookBack() {
    /* Nonmatching */
}

/* 00001498-0000157C       .text wait01__10daNpc_Ho_cFv */
void daNpc_Ho_c::wait01() {
    /* Nonmatching */
}

/* 0000157C-00001678       .text talk01__10daNpc_Ho_cFv */
void daNpc_Ho_c::talk01() {
    /* Nonmatching */
}

/* 00001678-000016E8       .text talk02__10daNpc_Ho_cFv */
void daNpc_Ho_c::talk02() {
    /* Nonmatching */
}

/* 000016E8-000017D4       .text talk03__10daNpc_Ho_cFv */
void daNpc_Ho_c::talk03() {
    /* Nonmatching */
}

/* 000017D4-00001884       .text give01__10daNpc_Ho_cFv */
void daNpc_Ho_c::give01() {
    /* Nonmatching */
}

/* 00001884-0000193C       .text give02__10daNpc_Ho_cFv */
void daNpc_Ho_c::give02() {
    /* Nonmatching */
}

/* 0000193C-00001A00       .text preach__10daNpc_Ho_cFv */
void daNpc_Ho_c::preach() {
    /* Nonmatching */
}

/* 00001A00-00001B2C       .text wait_action__10daNpc_Ho_cFPv */
void daNpc_Ho_c::wait_action(void*) {
    /* Nonmatching */
}

/* 00001B2C-00001C94       .text _draw__10daNpc_Ho_cFv */
s32 daNpc_Ho_c::_draw() {
    /* Nonmatching */
}

/* 00001C94-00001EB0       .text _execute__10daNpc_Ho_cFv */
s32 daNpc_Ho_c::_execute() {
    /* Nonmatching */
}

/* 00001EB0-00001EFC       .text _delete__10daNpc_Ho_cFv */
s32 daNpc_Ho_c::_delete() {
    dComIfG_resDelete(&mPhs, "Ho");

    if (mpMcaMorf != NULL) {
        mpMcaMorf->stopZelAnime();
    }

    return TRUE;
}

/* 00001EFC-00001F1C       .text CheckCreateHeap__FP10fopAc_ac_c */
s32 CheckCreateHeap(fopAc_ac_c* i_actor) {
    /* Nonmatching */
    return static_cast<daNpc_Ho_c*>(i_actor)->CreateHeap();
}

/* 00001F1C-00002124       .text _create__10daNpc_Ho_cFv */
s32 daNpc_Ho_c::_create() {
    /* Nonmatching */
    fopAcM_SetupActor(this, daNpc_Ho_c);

    s32 result = dComIfG_resLoad(&mPhs, "Ho");
    if (result == cPhs_COMPLEATE_e) {
        switch (fopAcM_GetName(this)) {
            case PROC_NPC_HO:
                m06A9 = false;
                break;
            default:
                return cPhs_ERROR_e;
        }

        fopAcM_SetStatusMap(this, 8);
        fopAcM_OnStatus(this, fopAcStts_SHOWMAP_e);

        bool heapResult = fopAcM_entrySolidHeap(this, (heapCallbackFunc)CheckCreateHeap, 0xB7B0);
        if (heapResult == false) {
            mpMcaMorf = NULL;
            return cPhs_ERROR_e;
        }

        fopAcM_SetMtx(this, mpMcaMorf->getModel()->getBaseTRMtx());

        if (init() == 0) {
            mpMcaMorf = NULL;
            return cPhs_ERROR_e;
        }
    }

    return result;
}

/* 000023F0-00002784       .text CreateHeap__10daNpc_Ho_cFv */
s32 daNpc_Ho_c::CreateHeap() {
    /* Nonmatching */
    return 0;
}

/* 00002784-000027A4       .text daNpc_Ho_Create__FP10fopAc_ac_c */
s32 daNpc_Ho_Create(fopAc_ac_c* i_actor) {
    return static_cast<daNpc_Ho_c*>(i_actor)->_create();
}

/* 000027A4-000027C4       .text daNpc_Ho_Delete__FP10daNpc_Ho_c */
s32 daNpc_Ho_Delete(daNpc_Ho_c* i_ho) {
    return i_ho->_delete();
}

/* 000027C4-000027E4       .text daNpc_Ho_Execute__FP10daNpc_Ho_c */
s32 daNpc_Ho_Execute(daNpc_Ho_c* i_ho) {
    return i_ho->_execute();
}

/* 000027E4-00002804       .text daNpc_Ho_Draw__FP10daNpc_Ho_c */
s32 daNpc_Ho_Draw(daNpc_Ho_c* i_ho) {
    return i_ho->_draw();
}

/* 00002804-0000280C       .text daNpc_Ho_IsDelete__FP10daNpc_Ho_c */
s32 daNpc_Ho_IsDelete(daNpc_Ho_c* i_ho) {
    return TRUE;
}

static actor_method_class l_daNpc_Ho_Method = {
    (process_method_func)daNpc_Ho_Create,
    (process_method_func)daNpc_Ho_Delete,
    (process_method_func)daNpc_Ho_Execute,
    (process_method_func)daNpc_Ho_IsDelete,
    (process_method_func)daNpc_Ho_Draw,
};

extern actor_process_profile_definition g_profile_NPC_HO = {
    fpcLy_CURRENT_e,
    7,
    fpcPi_CURRENT_e,
    PROC_NPC_HO,
    &g_fpcLf_Method.mBase,
    sizeof(daNpc_Ho_c),
    0,
    0,
    &g_fopAc_Method.base,
    0x0173,
    &l_daNpc_Ho_Method,
    0x40000 | fopAcStts_CULL_e | fopAcStts_NOEXEC_e,
    fopAc_ACTOR_e,
    fopAc_CULLBOX_12_e,
};

/* 00002934-00002950       .text setEyePos__10daNpc_Ho_cF4cXyz */
void daNpc_Ho_c::setEyePos(cXyz i_eyePos) {
    /* Nonmatching */
    mEyePos = i_eyePos;
}

/* 00002950-0000296C       .text setAttentionBasePos__10daNpc_Ho_cF4cXyz */
void daNpc_Ho_c::setAttentionBasePos(cXyz i_atnPos) {
    /* Nonmatching */
    mAttentionBasePos = i_atnPos;
}
